INSERT INTO public.material_types ("name",defects_percentage) VALUES
	 ('Тип материала 1',0.001),
	 ('Тип материала 2',0.0095),
	 ('Тип материала 3',0.0028),
	 ('Тип материала 4',0.0055),
	 ('Тип материала 5',0.0034);
INSERT INTO public.partner_types ("name") VALUES
	 ('ЗАО'),
	 ('ООО'),
	 ('ПАО'),
	 ('ОАО');
INSERT INTO public.partners ("name",director,email,telephone_number,inn,rating,legal_address) VALUES
	 ('База Строитель','Иванова Александра Ивановна','aleksandraivanova@ml.ru','493 123 45 67','2222455179',7,'652050, Кемеровская область, город Юрга, ул. Лесная, 15'),
	 ('Паркет 29','Петров Василий Петрович','vppetrov@vl.ru','987 123 56 78','3333888520',7,'164500, Архангельская область, город Северодвинск, ул. Строителей, 18'),
	 ('Стройсервис','Соловьев Андрей Николаевич','ansolovev@st.ru','812 223 32 00','4440391035',7,'188910, Ленинградская область, город Приморск, ул. Парковая, 21'),
	 ('Ремонт и отделка','Воробьева Екатерина Валерьевна','ekaterina.vorobeva@ml.ru','444 222 33 11','1111520857',5,'143960, Московская область, город Реутов, ул. Свободы, 51'),
	 ('МонтажПро','Степанов Степан Сергеевич','stepanov@stepan.ru','912 888 33 33','5552431140',10,'309500, Белгородская область, город Старый Оскол, ул. Рабочая, 122'),
	 ('тестовая штучка','cm','xhmng','457 87','76356',9,'адрессссссс');
INSERT INTO public.partners_products (date_of_sale) VALUES
	 ('2023-03-23 00:00:00'),
	 ('2023-12-18 00:00:00'),
	 ('2024-06-07 00:00:00'),
	 ('2022-12-02 00:00:00'),
	 ('2023-05-17 00:00:00'),
	 ('2024-06-07 00:00:00'),
	 ('2024-07-01 00:00:00'),
	 ('2023-01-22 00:00:00'),
	 ('2024-07-05 00:00:00'),
	 ('2023-03-20 00:00:00');
INSERT INTO public.partners_products (date_of_sale) VALUES
	 ('2024-03-12 00:00:00'),
	 ('2024-05-14 00:00:00'),
	 ('2023-09-19 00:00:00'),
	 ('2023-11-10 00:00:00'),
	 ('2024-04-15 00:00:00'),
	 ('2024-06-12 00:00:00');
INSERT INTO public.product_types (type_name,type_factor) VALUES
	 ('Ламинат',2.35),
	 ('Массивная доска',5.15),
	 ('Паркетная доска',4.34),
	 ('Пробковое покрытие',1.5);
INSERT INTO public.products ("name",articul,min_cost_for_partner) VALUES
	 ('Паркетная доска Ясень темный однополосная 14 мм','8758385',4456.90),
	 ('Инженерная доска Дуб Французская елка однополосная 12 мм','8858958',7330.99),
	 ('Ламинат Дуб дымчато-белый 33 класс 12 мм','7750282',1799.33),
	 ('Ламинат Дуб серый 32 класс 8 мм с фаской','7028748',3890.41),
	 ('Пробковое напольное клеевое покрытие 32 класс 4 мм','5012543',5450.59);
